In [1]:
import pandas as pd

In [43]:
df= pd.DataFrame({"A" :[12,3,4] , "B":[5,6,7]})

In [44]:
df["c"] =  [9,10,11]

In [45]:
df

    A  B   c
0  12  5   9
1   3  6  10
2   4  7  11

In [46]:
df['d'] = df["A"] *3

In [47]:
df

    A  B   c   d
0  12  5   9  36
1   3  6  10   9
2   4  7  11  12

In [48]:
df_new = df.assign(
    new_column_1=[7, 8, 9],
    new_column_2=df['B'] + 10
)

In [49]:
df_new

    A  B   c   d  new_column_1  new_column_2
0  12  5   9  36             7            15
1   3  6  10   9             8            16
2   4  7  11  12             9            17

In [50]:
df_new.insert(1,value=["HARSH",'VARUN','KENAL'],column='inserted_column')

In [51]:
df_new.set_index("inserted_column")

                  A  B   c   d  new_column_1  new_column_2
inserted_column
HARSH            12  5   9  36             7            15
VARUN             3  6  10   9             8            16
KENAL             4  7  11  12             9            17

In [61]:
df.loc[[0,1,2],"h"] = [1,2,3]

In [62]:
df

    A  B   c   d    h
0  12  5   9  36  1.0
1   3  6  10   9  2.0
2   4  7  11  12  3.0